Repository: xcv58/MacTools
Catalog: Plugins/ZshConfig/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# configuration.description
source: 在应用内查看和编辑 zsh 配置文件，并快速插入常用片段。
ar: اعرض وحرر ملفات إعداد zsh داخل التطبيق، مع إدراج سريع للمقتطفات الشائعة.
de: zsh-Konfigurationsdateien in der App anzeigen und bearbeiten, mit Schnelleinfügung häufiger Snippets.
en: View and edit zsh config files in the app, with quick insertion for common snippets.
es: Ve y edita archivos de config. zsh en la app, con inserción rápida de fragmentos comunes.
fr: Affichez et modifiez les fichiers de config. zsh dans l’app, avec insertion rapide d’extraits courants.
ja: App 内で zsh 設定ファイルを表示、編集し、よく使うスニペットをすばやく挿入できます。
ko: 앱에서 zsh 설정 파일을 보고 편집하며, 자주 쓰는 스니펫을 빠르게 삽입합니다.
pt: Veja e edite arquivos de config. zsh no app, com inserção rápida de trechos comuns.
ru: Просматривайте и редактируйте файлы zsh в приложении, быстро вставляя типовые фрагменты.
tr: zsh yapılandırma dosyalarını uygulama içinde görüntüleyin ve düzenleyin; sık kullanılan parçaları hızlıca ekleyin.
zh_hant: 在 App 內檢視和編輯 zsh 設定檔，並快速插入常用片段。

# editor.action.createFile
source: 创建文件
ar: إنشاء ملف
de: Datei erstellen
en: Create File
es: Crear archivo
fr: Créer un fichier
ja: ファイルを作成
ko: 파일 생성
pt: Criar arquivo
ru: Создать файл
tr: Dosya Oluştur
zh_hant: 建立檔案

# editor.action.openExternal
source: 在系统编辑器中打开
ar: فتح في محرر النظام
de: Im Systemeditor öffnen
en: Open in System Editor
es: Abrir en el editor del sistema
fr: Ouvrir dans l’éditeur système
ja: システムエディタで開く
ko: 시스템 편집기에서 열기
pt: Abrir no editor do sistema
ru: Открыть в системном редакторе
tr: Sistem Düzenleyicide Aç
zh_hant: 在系統編輯器中開啟

# editor.action.openExternal.help
source: 在系统默认文本编辑器中打开此文件
ar: افتح هذا الملف في محرر النصوص الافتراضي
de: Diese Datei im Standard-Texteditor öffnen
en: Open this file in the default text editor
es: Abre este archivo en el editor de texto predeterminado
fr: Ouvrir ce fichier dans l’éditeur de texte par défaut
ja: このファイルをデフォルトのテキストエディタで開く
ko: 이 파일을 기본 텍스트 편집기에서 열기
pt: Abra este arquivo no editor de texto padrão
ru: Открыть файл в текстовом редакторе по умолчанию
tr: Bu dosyayı varsayılan metin düzenleyicide açar.
zh_hant: 在系統預設文字編輯器中開啟此檔案

# editor.action.save
source: 保存
ar: حفظ
de: Speichern
en: Save
es: Guardar
fr: Enregistrer
ko: 저장
pt: Salvar
ru: Сохранить
tr: Kaydet

# editor.action.save.help
source: 保存前会自动备份为 %@.bak
ar: يتم حفظ نسخة احتياطية باسم %@.bak قبل الكتابة
de: Vor dem Schreiben wird eine Sicherung als %@.bak gespeichert
en: A backup is saved as %@.bak before writing
es: Se guarda una copia como %@.bak antes de escribir
fr: Une sauvegarde %@.bak est créée avant l’écriture
ja: 書き込み前に %@.bak としてバックアップします
ko: 쓰기 전에 %@.bak로 백업됩니다
pt: Um backup é salvo como %@.bak antes de gravar
ru: Перед записью создается резервная копия %@.bak
tr: Yazmadan önce %@.bak olarak yedeklenir.
zh_hant: 儲存前會自動備份為 %@.bak

# editor.action.saveUnsaved
source: 保存*
ar: حفظ*
de: Speichern*
en: Save*
es: Guardar*
fr: Enregistrer*
ko: 저장*
pt: Salvar*
ru: Сохранить*
tr: Kaydet*

# editor.action.saved
source: 已保存
ar: تم الحفظ
de: Gespeichert
en: Saved
es: Guardado
fr: Enregistré
ja: 保存済み
ko: 저장됨
pt: Salvo
ru: Сохранено
tr: Kaydedildi

# editor.emptyFile.placeholder
source: 文件为空。可直接输入，或切换到“快速插入”添加常用配置。
ar: الملف فارغ. اكتب هنا أو انتقل إلى الإدراج السريع لإضافة إعدادات شائعة.
de: Die Datei ist leer. Hier tippen oder per Schnelleinfügung häufige Einstellungen hinzufügen.
en: The file is empty. Type here, or switch to Quick Insert to add common settings.
es: El archivo está vacío. Escribe aquí o usa Inserción rápida para añadir ajustes comunes.
fr: Le fichier est vide. Saisissez du texte ici ou utilisez Insertion rapide pour ajouter des réglages courants.
ja: ファイルは空です。ここに入力するか、クイック挿入でよく使う設定を追加します。
ko: 파일이 비어 있습니다. 여기에 입력하거나 빠른 삽입으로 일반 설정을 추가하세요.
pt: O arquivo está vazio. Digite aqui ou use Inserção rápida para adicionar ajustes comuns.
ru: Файл пуст. Введите текст здесь или откройте быструю вставку для типовых настроек.
tr: Dosya boş. Buraya yazın veya sık kullanılan ayarlar için Hızlı Ekle sekmesine geçin.
zh_hant: 檔案是空的。可直接輸入，或切換到「快速插入」加入常用設定。

# editor.fileInfo.help
source: 查看加载时机与推荐用途
ar: عرض وقت التحميل والاستخدام الموصى به
de: Ladezeitpunkt und empfohlene Nutzung anzeigen
en: View load timing and recommended usage
es: Ver cuándo se carga y el uso recomendado
fr: Afficher le moment de chargement et l’usage conseillé
ja: 読み込みタイミングと推奨用途を表示
ko: 로드 시점과 권장 용도 보기
pt: Ver quando carrega e o uso recomendado
ru: Показать время загрузки и рекомендации
tr: Yükleme zamanını ve önerilen kullanımı gösterir.
zh_hant: 檢視載入時機與建議用途

# editor.fileInfo.missing
source: 文件不存在
ar: لم يتم العثور على الملف
de: Datei nicht gefunden
en: File not found
es: Archivo no encontrado
fr: Fichier introuvable
ja: ファイルが見つかりません
ko: 파일을 찾을 수 없습니다
pt: Arquivo não encontrado
ru: Файл не найден
tr: Dosya bulunamadı
zh_hant: 檔案不存在

# editor.fileInfo.modifiedAgo
source: 前修改
ar: منذ
de: vor
en: ago
es: hace
fr: il y a
ja: 前
ko: 전
pt: atrás
ru: назад
tr: önce

# editor.fileInfo.recommendedUse
source: 推荐用途
ar: الاستخدام
de: Verwenden für
en: Use For
es: Usar para
fr: Utiliser pour
ja: 用途
ko: 용도
pt: Usar para
ru: Для чего
tr: Kullanım Amacı
zh_hant: 建議用途

# editor.fileInfo.whenLoaded
source: 加载时机
ar: التحميل
de: Geladen
en: Loaded
es: Carga
fr: Chargement
ja: 読み込み
ko: 로드
pt: Carrega
ru: Загрузка
tr: Yükleme Zamanı
zh_hant: 載入時機

# editor.fileSelector.title
source: 配置文件
ar: ملفات الإعداد
de: Konfigurationsdateien
en: Config Files
es: Archivos de config.
fr: Fichiers de config.
ja: 設定ファイル
ko: 설정 파일
pt: Arquivos de config.
ru: Файлы настроек
tr: Yapılandırma Dosyaları
zh_hant: 設定檔

# editor.missingFile.createDescription
source: 点击“创建文件”将在家目录生成 %@ 并填入说明注释。
ar: انقر على إنشاء ملف لإنشاء %@ في مجلدك الرئيسي مع تعليقات توضيحية.
de: Klicken Sie auf „Datei erstellen“, um %@ mit erklärenden Kommentaren im Home-Ordner zu erstellen.
en: Click Create File to create %@ in your home folder with explanatory comments.
es: Haz clic en Crear archivo para crear %@ en tu carpeta de inicio con comentarios explicativos.
fr: Cliquez sur Créer un fichier pour créer %@ dans votre dossier personnel avec des commentaires explicatifs.
ja: 「ファイルを作成」をクリックすると、ホームフォルダに説明コメント付きの %@ を作成します。
ko: 파일 생성을 클릭하면 홈 폴더에 설명 주석과 함께 %@이(가) 생성됩니다.
pt: Clique em Criar arquivo para criar %@ na sua pasta pessoal com comentários explicativos.
ru: Нажмите «Создать файл», чтобы создать %@ в домашней папке с поясняющими комментариями.
tr: Dosya Oluştür'e tıklayarak %@ dosyasını açıklama yorumlarıyla birlikte kişisel klasörünüzde oluşturun.
zh_hant: 按一下「建立檔案」會在個人資料夾建立 %@，並填入說明註解。

# editor.missingFile.readOnlyDescription
source: 家目录不可写，无法创建此文件。请检查磁盘权限。
ar: المجلد الرئيسي غير قابل للكتابة، لذلك لا يمكن إنشاء هذا الملف. تحقق من أذونات القرص.
de: Ihr Home-Ordner ist nicht beschreibbar. Diese Datei kann nicht erstellt werden. Prüfen Sie die Zugriffsrechte.
en: Your home folder is not writable, so this file cannot be created. Check disk permissions.
es: Tu carpeta de inicio no permite escritura, por lo que no se puede crear este archivo. Revisa los permisos del disco.
fr: Votre dossier personnel n’est pas accessible en écriture. Impossible de créer ce fichier. Vérifiez les autorisations du disque.
ja: ホームフォルダに書き込めないため、このファイルを作成できません。ディスクのアクセス権を確認してください。
ko: 홈 폴더에 쓸 수 없어 이 파일을 만들 수 없습니다. 디스크 권한을 확인하세요.
pt: Sua pasta pessoal não permite gravação, então este arquivo não pode ser criado. Verifique as permissões do disco.
ru: Домашняя папка недоступна для записи, поэтому файл нельзя создать. Проверьте права доступа к диску.
tr: Kişisel klasörünüz yazılabilir olmadığından bu dosya oluşturulamıyor. Disk izinlerini denetleyin.
zh_hant: 個人資料夾不可寫入，無法建立此檔案。請檢查磁碟權限。

# editor.missingFile.title
source: 文件尚不存在
ar: الملف غير موجود
de: Datei ist nicht vorhanden
en: File does not exist
es: El archivo no existe
fr: Le fichier n’existe pas
ja: ファイルが存在しません
ko: 파일이 없습니다
pt: O arquivo não existe
ru: Файл не существует
tr: Dosya mevcut değil
zh_hant: 檔案尚不存在

# editor.quickInsert.insertAtEnd
source: 插入到末尾
ar: إدراج في النهاية
de: Am Ende einfügen
en: Insert at End
es: Insertar al final
fr: Insérer à la fin
ja: 末尾に挿入
ko: 끝에 삽입
pt: Inserir no fim
ru: Вставить в конец
tr: Sona Ekle
zh_hant: 插入到結尾

# editor.quickInsert.switchToEditor
source: 切换到编辑器
ar: التبديل إلى المحرر
de: Zum Editor wechseln
en: Switch to Editor
es: Cambiar al editor
fr: Passer à l’éditeur
ja: エディタに切り替え
ko: 편집기로 전환
pt: Mudar para editor
ru: Перейти в редактор
tr: Düzenleyiciye Geç
zh_hant: 切換到編輯器

# editor.quickInsert.target
source: 插入到 %@
ar: أدخل في %@
de: Einfügen in %@
en: Insert into %@
es: Insertar en %@
fr: Insérer dans %@
ja: %@ に挿入
ko: %@에 삽입
pt: Inserir em %@
ru: Вставить в %@
tr: %@ Dosyasına Ekle

# editor.readOnly
source: 只读
ar: للقراءة فقط
de: Schreibgeschützt
en: Read Only
es: Solo lectura
fr: Lecture seule
ja: 読み取り専用
ko: 읽기 전용
pt: Somente leitura
ru: Только чтение
tr: Salt Okunur
zh_hant: 只讀

# editor.savedHint.reloadDescription
source: 执行后无需重启终端即可生效。
ar: شغّل هذا لتطبيق التغييرات دون إعادة تشغيل Terminal.
de: Ausführen, um Änderungen ohne Neustart von Terminal zu übernehmen.
en: Run this to apply changes without restarting Terminal.
es: Ejecuta esto para aplicar los cambios sin reiniciar Terminal.
fr: Exécutez ceci pour appliquer les changements sans redémarrer Terminal.
ja: ターミナルを再起動せずに変更を適用できます。
ko: 터미널을 재시작하지 않고 변경 사항을 적용합니다.
pt: Execute isto para aplicar as alterações sem reiniciar o Terminal.
ru: Запустите это, чтобы применить изменения без перезапуска Terminal.
tr: Terminal'i yeniden başlatmadan değişiklikleri uygulamak için bunu çalıştırın.
zh_hant: 執行後不需重新啟動終端機即可生效。

# editor.savedHint.title
source: 已保存（已备份为 %@.bak）
ar: تم الحفظ (نسخة احتياطية باسم %@.bak)
de: Gespeichert (Sicherung als %@.bak)
en: Saved (backed up as %@.bak)
es: Guardado (copia en %@.bak)
fr: Enregistré (sauvegarde %@.bak)
ja: 保存済み（%@.bak としてバックアップ）
ko: 저장됨(%@.bak로 백업됨)
pt: Salvo (backup em %@.bak)
ru: Сохранено (резервная копия %@.bak)
tr: Kaydedildi (%@.bak olarak yedeklendi)
zh_hant: 已儲存（已備份為 %@.bak）

# editor.tab.editor
source: 编辑
ar: تحرير
de: Bearbeiten
en: Edit
es: Editar
fr: Modifier
ja: 編集
ko: 수정
pt: Editar
ru: Изменить
tr: Düzenle
zh_hant: 編輯

# editor.tab.quickInsert
source: 快速插入
ar: إدراج سريع
de: Schnelleinfügung
en: Quick Insert
es: Inserción rápida
fr: Insertion rapide
ja: クイック挿入
ko: 빠른 삽입
pt: Inserção rápida
ru: Быстрая вставка
tr: Hızlı Ekle

# file.zlogin.recommendedUse
source: 欢迎信息、tmux 自动启动等
ar: رسائل الترحيب والتشغيل التلقائي لـ tmux وإجراءات مشابهة
de: Willkommensnachrichten, tmux-Autostart und ähnliche Login-Aktionen
en: Welcome messages, tmux autostart, and similar login actions
es: Mensajes de bienvenida, inicio automático de tmux y acciones similares
fr: Messages de bienvenue, démarrage automatique de tmux et actions similaires
ja: ウェルカムメッセージ、tmux 自動起動など
ko: 환영 메시지, tmux 자동 시작 등
pt: Mensagens de boas-vindas, início automático do tmux e ações similares
ru: Приветствия, автозапуск tmux и похожие действия при входе
tr: Karşılama iletileri, tmux otomatik başlatma ve benzeri oturum açma eylemleri
zh_hant: 歡迎訊息、tmux 自動啟動等

# file.zlogin.role
source: 登录 Shell 完成初始化后执行
ar: يعمل بعد اكتمال تهيئة login shell
de: Wird nach Abschluss der Login-Shell-Initialisierung ausgeführt
en: Runs after login shell initialization completes
es: Se ejecuta después de completar la inicialización del shell de inicio
fr: S’exécute après l’initialisation du shell de connexion
ja: ログインシェルの初期化完了後に実行
ko: 로그인 셸 초기화가 완료된 뒤 실행
pt: Executado após a inicialização do shell de login
ru: Выполняется после завершения инициализации login shell
tr: Oturum açma Shell'i tam olarak başlatıldıktan sonra çalışır
zh_hant: 登入 shell 完成初始化後執行

# file.zlogin.whenLoaded
source: 登录时，晚于 .zshrc
ar: عند تسجيل الدخول، بعد .zshrc
de: Bei der Anmeldung, nach .zshrc
en: At login, after .zshrc
es: Al iniciar sesión, después de .zshrc
fr: À la connexion, après .zshrc
ja: ログイン時。.zshrc より後
ko: 로그인 시, .zshrc 이후
pt: No login, após .zshrc
ru: При входе, после .zshrc
tr: Oturum açıldığında, .zshrc'den sonra
zh_hant: 登入時，晚於 .zshrc

# file.zlogout.recommendedUse
source: 清理临时文件、记录会话日志
ar: تنظيف الملفات المؤقتة أو تسجيل سجلات الجلسة
de: Temporäre Dateien bereinigen oder Sitzungsprotokolle aufzeichnen
en: Clean temporary files or record session logs
es: Limpiar archivos temporales o registrar sesiones
fr: Nettoyer les fichiers temporaires ou enregistrer les journaux de session
ja: 一時ファイルの削除、セッションログの記録
ko: 임시 파일 정리 또는 세션 로그 기록
pt: Limpar arquivos temporários ou registrar logs de sessão
ru: Очистка временных файлов или запись журналов сеанса
tr: Geçici dosyaları temizleme veya oturum günlüklerini kaydetme
zh_hant: 清理暫存檔、記錄工作階段日誌

# file.zlogout.role
source: 退出登录 Shell 时执行的清理脚本
ar: سكربت تنظيف يعمل عند خروج login shell
de: Bereinigungsskript beim Beenden einer Login-Shell
en: Cleanup script run when a login shell exits
es: Script de limpieza que se ejecuta al salir del shell de inicio
fr: Script de nettoyage exécuté à la fermeture du shell de connexion
ja: ログインシェル終了時に実行するクリーンアップスクリプト
ko: 로그인 셸 종료 시 실행되는 정리 스크립트
pt: Script de limpeza executado ao sair do shell de login
ru: Скрипт очистки при выходе из login shell
tr: Oturum açma Shell'i kapanırken çalışan temizleme betiği
zh_hant: 結束登入 shell 時執行的清理腳本

# file.zlogout.whenLoaded
source: 登录 Shell 退出时（`exit` 或关闭终端）
ar: عند خروج login shell (`exit` أو إغلاق Terminal)
de: Wenn eine Login-Shell beendet wird (`exit` oder Terminal schließen)
en: When a login shell exits (`exit` or closing Terminal)
es: Cuando sale un shell de inicio (`exit` o al cerrar Terminal)
fr: Quand un shell de connexion se ferme (`exit` ou fermeture de Terminal)
ja: ログインシェル終了時（`exit` またはターミナルを閉じる）
ko: 로그인 셸 종료 시(`exit` 또는 터미널 닫기)
pt: Quando um shell de login sai (`exit` ou ao fechar o Terminal)
ru: При выходе из login shell (`exit` или закрытие Terminal)
tr: Oturum açma Shell'i kapanırken (`exit` veya Terminal kapatılırken)
zh_hant: 登入 shell 結束時（`exit` 或關閉終端機）

# file.zprofile.recommendedUse
source: Homebrew 环境初始化、一次性登录脚本
ar: إعداد بيئة Homebrew وسكربتات تسجيل الدخول لمرة واحدة
de: Homebrew-Umgebungseinrichtung und einmalige Login-Skripte
en: Homebrew environment setup and one-time login scripts
es: Configuración del entorno de Homebrew y scripts de inicio únicos
fr: Configuration de l’environnement Homebrew et scripts de connexion ponctuels
ja: Homebrew 環境設定、一度だけ実行するログインスクリプト
ko: Homebrew 환경 설정 및 일회성 로그인 스크립트
pt: Configuração do ambiente Homebrew e scripts de login únicos
ru: Настройка среды Homebrew и однократные скрипты входа
tr: Homebrew ortamı kurulumu ve tek seferlik oturum açma betikleri
zh_hant: Homebrew 環境初始化、一次性登入腳本

# file.zprofile.role
source: 登录 Shell 初始化，早于 .zshrc
ar: تهيئة login shell قبل .zshrc
de: Initialisierung der Login-Shell vor .zshrc
en: Login shell initialization, before .zshrc
es: Inicialización del shell de inicio, antes de .zshrc
fr: Initialisation du shell de connexion, avant .zshrc
ja: ログインシェル初期化。.zshrc より前
ko: 로그인 셸 초기화. .zshrc보다 먼저 실행
pt: Inicialização do shell de login, antes de .zshrc
ru: Инициализация login shell до .zshrc
tr: Oturum açma Shell'i başlatma; .zshrc'den önce
zh_hant: 登入 shell 初始化，早於 .zshrc

# file.zprofile.whenLoaded
source: 登录时（SSH、macOS 登录等），早于 .zshrc
ar: عند تسجيل الدخول (SSH أو تسجيل دخول macOS ونحوه)، قبل .zshrc
de: Bei der Anmeldung (SSH, macOS-Anmeldung usw.), vor .zshrc
en: At login (SSH, macOS login, and similar), before .zshrc
es: Al iniciar sesión (SSH, inicio de macOS, etc.), antes de .zshrc
fr: À la connexion (SSH, connexion macOS, etc.), avant .zshrc
ja: ログイン時（SSH、macOS ログインなど）。.zshrc より前
ko: 로그인 시(SSH, macOS 로그인 등), .zshrc보다 먼저
pt: No login (SSH, login do macOS etc.), antes de .zshrc
ru: При входе (SSH, вход в macOS и т. п.), до .zshrc
tr: Oturum açıldığında (SSH, macOS oturum açma vb.), .zshrc'den önce
zh_hant: 登入時（SSH、macOS 登入等），早於 .zshrc

# file.zshenv.recommendedUse
source: EDITOR、LANG、必须对所有子进程可见的变量
ar: EDITOR وLANG والمتغيرات المطلوبة لكل العمليات الفرعية
de: EDITOR, LANG und Variablen, die alle untergeordneten Prozesse benötigen
en: EDITOR, LANG, and variables required by all child processes
es: EDITOR, LANG y variables que todos los procesos secundarios necesitan
fr: EDITOR, LANG et variables requises par tous les processus enfants
ja: EDITOR、LANG、すべての子プロセスに必要な変数
ko: EDITOR, LANG 및 모든 하위 프로세스에 필요한 변수
pt: EDITOR, LANG e variáveis exigidas por todos os processos filhos
ru: EDITOR, LANG и переменные, нужные всем дочерним процессам
tr: EDITOR, LANG ve tüm alt süreçlerin gerektirdiği değişkenler
zh_hant: EDITOR、LANG、必須讓所有子行程可見的變數

# file.zshenv.role
source: 所有 Shell 的环境变量，最先被加载
ar: متغيرات البيئة لكل shell؛ يتم تحميله أولاً
de: Umgebungsvariablen für jede Shell; wird zuerst geladen
en: Environment variables for every shell; loaded first
es: Variables de entorno para todos los shells; se carga primero
fr: Variables d’environnement pour tous les shells ; chargé en premier
ja: すべてのシェル用の環境変数。最初に読み込まれます
ko: 모든 셸의 환경 변수. 가장 먼저 로드됨
pt: Variáveis de ambiente para todos os shells; carregado primeiro
ru: Переменные среды для всех оболочек; загружается первым
tr: Her Shell için ortam değişkenleri; ilk olarak yüklenir
zh_hant: 所有 Shell 的環境變數，最先載入

# file.zshenv.whenLoaded
source: 每次启动 zsh（包括脚本、非交互式）时
ar: كلما بدأ zsh، بما في ذلك السكربتات وshell غير التفاعلية
de: Immer wenn zsh startet, einschließlich Skripten und nicht interaktiver Shells
en: Whenever zsh starts, including scripts and non-interactive shells
es: Cada vez que zsh se inicia, incluidos scripts y shells no interactivos
fr: À chaque démarrage de zsh, y compris les scripts et shells non interactifs
ja: zsh の起動時（スクリプトや非対話型シェルを含む）
ko: 스크립트와 비대화형 셸을 포함해 zsh가 시작될 때마다
pt: Sempre que o zsh inicia, incluindo scripts e shells não interativos
ru: При каждом запуске zsh, включая скрипты и неинтерактивные оболочки
tr: zsh her başlatıldığında (betikler ve etkileşimli olmayan Shell'ler dahil)
zh_hant: 每次啟動 zsh（包含腳本與非互動式 shell）時

# file.zshrc.recommendedUse
source: alias、函数、主题（Oh My Zsh / Starship 等）、PATH
ar: الأسماء المستعارة والدوال والسمات (Oh My Zsh / Starship) وPATH
de: Aliase, Funktionen, Themes (Oh My Zsh / Starship) und PATH
en: Aliases, functions, themes (Oh My Zsh / Starship), and PATH
es: Aliases, funciones, temas (Oh My Zsh / Starship) y PATH
fr: Alias, fonctions, thèmes (Oh My Zsh / Starship) et PATH
ja: エイリアス、関数、テーマ（Oh My Zsh / Starship など）、PATH
ko: alias, 함수, 테마(Oh My Zsh / Starship 등), PATH
pt: Aliases, funções, temas (Oh My Zsh / Starship) e PATH
ru: Алиасы, функции, темы (Oh My Zsh / Starship) и PATH
tr: Takma adlar, işlevler, temalar (Oh My Zsh / Starship) ve PATH
zh_hant: alias、函式、主題（Oh My Zsh / Starship 等）、PATH

# file.zshrc.role
source: 交互式 Shell 配置：别名、函数、提示符等
ar: إعدادات shell التفاعلية: الأسماء المستعارة والدوال والمطالبات وغيرها
de: Interaktive Shell-Konfiguration: Aliase, Funktionen, Prompts und mehr
en: Interactive shell config: aliases, functions, prompts, and more
es: Config. de shell interactivo: alias, funciones, prompts y más
fr: Config. du shell interactif : alias, fonctions, invites, etc.
ja: 対話型シェル設定：エイリアス、関数、プロンプトなど
ko: 대화형 셸 설정: alias, 함수, 프롬프트 등
pt: Config. do shell interativo: aliases, funções, prompts e mais
ru: Настройки интерактивной оболочки: алиасы, функции, приглашения и др.
tr: Etkileşimli Shell yapılandırması: takma adlar, işlevler, komut istemleri ve daha fazlası
zh_hant: 互動式 Shell 設定：別名、函式、提示符等

# file.zshrc.whenLoaded
source: 每次打开新终端窗口/标签页时
ar: عند فتح نافذة أو تبويب Terminal جديد
de: Immer wenn ein neues Terminal-Fenster oder ein neuer Tab geöffnet wird
en: Whenever a new Terminal window or tab opens
es: Cada vez que se abre una ventana o pestaña de Terminal
fr: À chaque ouverture d’une fenêtre ou d’un onglet Terminal
ja: 新しいターミナルウインドウまたはタブを開くたび
ko: 새 터미널 윈도우나 탭을 열 때마다
pt: Sempre que uma nova janela ou aba do Terminal é aberta
ru: При каждом открытии нового окна или вкладки Terminal
tr: Yeni bir Terminal penceresi veya sekmesi her açıldığında
zh_hant: 每次開啟新的終端機視窗或分頁時

# metadata.description
source: 快速编辑 zsh 配置文件
ar: تحرير ملفات إعداد zsh بسرعة
de: zsh-Konfigurationsdateien schnell bearbeiten
en: Edit zsh config files quickly
es: Edita archivos de config. zsh rápido
fr: Modifiez vite les fichiers de config. zsh
ja: zsh 設定ファイルをすばやく編集
ko: zsh 설정 파일 빠르게 편집
pt: Edite arquivos de config. zsh rapidamente
ru: Быстрое редактирование файлов zsh
tr: zsh yapılandırma dosyalarını hızla düzenleyin
zh_hant: 快速編輯 zsh 設定檔

# metadata.title
source: zsh 配置
ar: إعدادات zsh
de: zsh-Konfig.
en: zsh Config
es: Config. zsh
fr: Config. zsh
ja: zsh 設定
ko: zsh 설정
pt: Config. zsh
ru: Настройки zsh
tr: zsh Yapılandırması
zh_hant: zsh 設定

# panel.button.edit
source: 编辑
ar: تحرير
de: Bearbeiten
en: Edit
es: Editar
fr: Modifier
ja: 編集
ko: 수정
pt: Editar
ru: Изменить
tr: Düzenle
zh_hant: 編輯

# panel.subtitle.noFiles
source: 未找到配置文件，打开设置创建
ar: لم يتم العثور على ملفات إعداد. افتح الإعدادات لإنشاء واحد.
de: Keine Konfigurationsdateien gefunden. In den Einstellungen erstellen.
en: No config files found. Open settings to create one.
es: No hay archivos de config. Abre ajustes para crear uno.
fr: Aucun fichier de config. Ouvrez les réglages pour en créer un.
ja: 設定ファイルが見つかりません。設定で作成できます。
ko: 설정 파일이 없습니다. 설정에서 생성하세요.
pt: Nenhum arquivo de config. Abra os ajustes para criar um.
ru: Файлы настроек не найдены. Создайте их в настройках.
tr: Yapılandırma dosyası bulunamadı. Oluşturmak için ayarları açın.
zh_hant: 找不到設定檔，請開啟設定建立

# snippet.alias.description
source: 为命令创建快捷方式
ar: أنشئ اختصاراً لأمر
de: Kurzbefehl für einen Befehl erstellen
en: Create a shortcut for a command
es: Crea un atajo para un comando
fr: Créez un raccourci pour une commande
ja: コマンドのショートカットを作成
ko: 명령 바로가기 만들기
pt: Crie um atalho para um comando
ru: Создать сокращение для команды
tr: Bir komut için kısayol oluşturur
zh_hant: 為命令建立捷徑

# snippet.alias.placeholder
source: 名称=命令，例：gs=git status
ar: name=command، مثال: gs=git status
de: Name=Befehl, z. B. gs=git status
en: name=command, e.g. gs=git status
es: nombre=comando, p. ej. gs=git status
fr: nom=commande, ex. gs=git status
ja: 名前=コマンド、例：gs=git status
ko: 이름=명령, 예: gs=git status
pt: nome=comando, ex. gs=git status
ru: имя=команда, напр. gs=git status
tr: ad=komut, örn. gs=git status
zh_hant: 名稱=命令，例：gs=git status

# snippet.alias.title
source: 别名
ar: اسم مستعار
de: Alias
en: Alias
es: Alias
fr: Alias
ja: エイリアス
ko: alias
pt: Alias
ru: Алиас
tr: Takma Ad
zh_hant: 別名

# snippet.eval.description
source: 执行工具的 eval 初始化命令
ar: شغّل أمر تهيئة eval للأداة
de: eval-Initialisierungsbefehl eines Tools ausführen
en: Run a tool’s eval initialization command
es: Ejecuta el comando eval de inicialización de una herramienta
fr: Exécutez la commande d’initialisation eval d’un outil
ja: ツールの eval 初期化コマンドを実行
ko: 도구의 eval 초기화 명령 실행
pt: Execute o comando eval de inicialização de uma ferramenta
ru: Запустить команду инициализации eval для инструмента
tr: Bir aracın eval başlatma komutunu çalıştırır
zh_hant: 執行工具的 eval 初始化命令

# snippet.eval.placeholder
source: 工具命令，例：$(brew shellenv)
ar: أمر الأداة، مثال: $(brew shellenv)
de: Tool-Befehl, z. B. $(brew shellenv)
en: tool command, e.g. $(brew shellenv)
es: comando de herramienta, p. ej. $(brew shellenv)
fr: commande d’outil, ex. $(brew shellenv)
ja: ツールコマンド、例：$(brew shellenv)
ko: 도구 명령, 예: $(brew shellenv)
pt: comando da ferramenta, ex. $(brew shellenv)
ru: команда инструмента, напр. $(brew shellenv)
tr: araç komutu, örn. $(brew shellenv)

# snippet.eval.title
source: 初始化工具
ar: تهيئة أداة
de: Tool initialisieren
en: Initialize Tool
es: Inicializar herramienta
fr: Initialiser l’outil
ja: ツールを初期化
ko: 도구 초기화
pt: Inicializar ferramenta
ru: Инициализация инструмента
tr: Aracı Başlat
